
    // --створити масив з:
    // - з 5 числових значень
    // - з 5 стічкових значень
    // - з 5 значень стрічкового, числового та булевого типу
    // - та вивести його в консоль

    // let firstArray = [[2, 5, 7, 10, 12], ['one', 'two', 'three', 'four', 'five'], ['twelve', 'twenty', 1, false, true]];
    // console.log(firstArray[0])
    // console.log(firstArray[1])
    // console.log(firstArray[2])


//  ===================================================================================================


    // -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу.
    //    Вивести в консоль

    // let secondArray = [];
    // for (let i = 0; i < 9; i++) {
    //     secondArray.push(i*2+3);
    // }   console.log(secondArray)


//  ===================================================================================================


    // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
    // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
    // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
    // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.

    // for (let i = 1; i <= 9; i++) {
    //     document.write('<div>Bloc "for"</div>')
    //     document.write(`<div>Bloc "for" with index ${i}</div>`)
    //     document.write('================')
    // }
    //
    // let i = 1;
    // while (i <= 7) {
    //     document.write('<h1>Bloc "while"</h1>')
    //     document.write(`<h1>Bloc "while with index" ${i}</h1>`)
    //     document.write('================')
    //     i++
    // }


//  ===================================================================================================


    // // - Створити масив з 10 числових елементів.
    //      Вивести в консоль всі його елементи в циклі.
    //
    // let tenNumbers = [];
    // for (let i = 0; i < 10; i++) {
    //     tenNumbers.push(i * 4 + 1)
    //     console.log(tenNumbers[i])
    // }
    // console.log('===================================')
    //
    //
    // // - Створити масив з 10 строкрових елементів.
    //      Вивести в консоль всі його елементи в циклі.
    //
    // let tenString = ['one', 'two', 'three', 'four', 'five', 'six', 'seven', 'eight', 'nine', 'ten'];
    // for (let i = 0; i < tenString.length; i++) {
    //     console.log(tenString[i])
    // }
    // console.log('===================================')
    //
    //
    // // - Створити масив з 10 елементів будь-якого типу.
    //      Вивести в консоль всі його елементи в циклі.
    //
    // let randomType = [1, 'twelve', false, 2, 6, 'twenty', 9, 'burger', true, 'apple']
    // for (let i = 0; i < 10; i++) {
    //     console.log(randomType[i])
    // }
    // console.log('===================================')


//  ===================================================================================================

    // - Створити масив з 10 елементів числового, стірчкового і булевого типу.
    //      За допомогою if та typeof вивести тільки булеві елементи

    // let tenRandomType = [1, 'twelve', false, 2, 6, 'twenty', 9, 'burger', true, 'apple']
    // for (let i = 0; i < tenRandomType.length; i++) {
    //     if (typeof tenRandomType[i] === 'boolean') {
    //         console.log(tenRandomType[i])
    //     }
    // }


//  ===================================================================================================

    // - Створити масив з 10 елементів числового, стірчкового і булевого типу.
    //      За допомогою if та typeof вивести тільки числові елементи

    // let tenRandomType = [1, 'twelve', false, 2, 6, 'twenty', 9, 'burger', true, 'apple']
    // for (let i = 0; i < tenRandomType.length; i++) {
    //     if (typeof tenRandomType[i] === 'number') {
    //         console.log(tenRandomType[i])
    //     }
    // }


//  ===================================================================================================

    // - Створити масив з 10 елементів числового, стрічкового і булевого типу.
    // За допомогою if та typeof вивести тільки рядкові елементи

    // let tenRandomType = [1, 'twelve', false, 2, 6, 'twenty', 9, 'burger', true, 'apple']
    // for (let i = 0; i < tenRandomType.length; i++) {
    //     if (typeof tenRandomType[i] === 'string') {
    //         console.log(tenRandomType[i])
    //     }
    // }


//  ===================================================================================================

    // - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів.
    // Вивести в консоль всі його елементи в циклі.

    // let tenArray = [];
    // for (let i = 0; i < 10; i++) {
    //     tenArray.push(2*i+3, false)
    //     tenArray.push(3*i, 'one')
    //     tenArray.push(true, 'six')
    //     console.log(tenArray[i])
    // }


//  ===================================================================================================

    // - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

    // for (let i = 0; i < 10; i++) {
    //     console.log([i])
    //     document.write([i])
    // }


//  ===================================================================================================

    // - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write

    // for (let i = 0; i < 100; i++) {
    //     console.log([i])
    //     document.write([i] + ' ')
    // }


//  ===================================================================================================

    // - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write

    // for (let i = 0; i < 100; i+=2) {
    //     console.log([i])
    //     document.write([i] + ' ')
    // }


//  ===================================================================================================

    // - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write

    // for ( let i = 2; i <= 100; i+=2) {
    //     if (i % 2 === 0) {
    //         console.log(i)
    //         document.write([i] + ' ')
    //     }
    // }


//  ===================================================================================================

    // - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write

    // for (let i = 0; i < 100; i++) {
    //     if (i % 2 === 1) {
    //         console.log(i)
    //         document.write([i] + ' ')
    //     }
    // }